const REGEXP = {
  EMAIL:
    /^[a-zA-Z0-9]+[-_.a-zA-Z0-9]*@[a-zA-Z0-9]+([-_.][a-zA-Z0-9]+)*\.[a-zA-Z]{2,}$/,
  INTELUCKEMAIL: /^[a-zA-Z0-9]+[-_.a-zA-Z0-9]*@inteluck.com$/,
  PHONE: /^(\+?\d{0,9}\s)?\d{0,20}$/,
  PASSWORD:
    /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[%`~!@+#$^&*()=|{}':;,\\.<>/?！￥…（）—\\[\]【】‘；：”“。，、？])[A-Za-z\d`%~!@+#$^&*()=|{}':;,\\.<>/?！￥…（）—\\[\]【】‘；：”“。，、？]{8,}/,
  WHITESPACE: /^\S+$/,
  DIGIT_LETTER: /^[A-Za-z0-9]+$/,
  LETTER_SPACE: /^[A-Za-z\s]+$/,
  NUMBER: /^([0-9]\d{0,1}|100)$/,
  POSITIVE_INTEGER: /^\+?[1-9]\d{0,7}$/,
  POSITIVE_INTEGER_D2: /^([0-9]\d{0,7})(\.\d{1,2})?$/, // 整数位不超过8位，小数位不超过2位
  WEBSITE_URL:
    /^(https?:\/\/)?([a-zA-Z0-9-]+\.)+[a-zA-Z]{2,}(:\d+)?(\/[^\s]*)?$/,
};

export default REGEXP;
